{
    "items": [
        {
            "name": "Susan Beetlestone",
            "company": "Personal client",
            "testimonial": "<p>I have known Adam Stubbings for the past five years and can but praise the service I have experienced.</p><p>Adam has a very commendable structured approach which is delivered in an informal, confident, open and honest manner. His retention of an individual's personal circumstances, which extends to their nuclear family, is a unique quality and enables him to be very proactive in tailoring the offer to his clients, especially during periods of change.</p><p>He is very reactive to both market changes and those of an individual's personal circumstances. Having had experience of this over the years, each change has resulted in a review of my portfolio to best suit the new situation as once Adam is informed of the changes, he takes immediate and appropriate action.</p><p>The best compliment that I can bestow on Adam is that, where my finances are concerned, I no longer worry about my past, present or future.</p>"
        },
        {
            "name": "Mark Cluett",
            "company": "Director, Atomik.biz",
            "testimonial": "<p>I have been the owner and Director of my own IT Consultancy business for 13 years and have known Adam Stubbings most of this time. Although initially we met through cave diving, I had no hesitation in approaching Adam and engaging him as my Financial Adviser when I needed someone I could trust to sort out my personal finances.</p><p>At the beginning he advised me with some pension money I had in an old employer's pension scheme. Today, as a father with a young family I have peace of mind as he manages my personal pensions, investments and has also sorted out my life assurance so I do not need to worry about my family's future security if anything should happen to me.</p><p>Although I no longer cave dive I have dived many underwater cave systems around the world with Adam as my buddy, so I know he can be trusted.</p> "
        },
        {
            "name": "I.A. McLeay",
            "company": "Managing Director, Osiris Projects, Seabed mapping & coastal survey",
            "testimonial": "<p>We can confirm that we have been associated with Adam Stubbings for approximately ten years now in his capacity as Independent Financial Adviser. Our experience of Adam has been extensive and he has advised and managed numerous personal and corporate plans for us, both during his time with Cullen Financial Planning and now with his own company Compass Financial.</p><p>We have found Adam to be a very proactive adviser over the years and we have complete confidence in the advice and guidance given. Osiris Projects employs more than 90 full time staff and Compass Financial manage our Group Personal Pension Scheme, our corporate healthcare scheme, the Director's SSAS and a number of bespoke business protection and investment plans.</p><p>We have no hesitation in recommending the services of Compass Financial to any of their prospective customers.</p>"
        },
        {
            "name": "Adam Stubbings",
            "company": "Director and Principal",
            "testimonial": "<p>My husband John and I were introduced to Adam Stubbings several years ago when he took over the portfolio of our previous Financial Adviser. We liked him immediately and came to trust him implicitly with all our financial affairs. Since my husband died two years ago, I have continued to rely on Adam's careful, considered advice and I really can't speak highly enough of him.</p><p>One of the things I really appreciate about him is how much care he takes to explain things. He's never pushy and he makes sure I understand all the options before I make a decision. I think that some financial advisers can blind you with science, but Adam keeps things straightforward and I feel completely at ease with him. He's a pleasure to deal with and is always so punctual – I joke with him that he must sit at the bottom of the road waiting for the exact minute of the start of our review appointments!</p><p>Adam's style and friendliness extends to his team in the office. His colleagues are all helpful and polite. I have no hesitation in recommending Adam and his company Compass Financial.</p>"
        }
    ]
}